[
  {
    "Dungeons": {
      "Undercroft": [
        [
          [ "Crypt", " Torches along the wall burn with a blue-green flame, casting flickering light over a row of\n sarcophagi — one of which appears broken from the inside, sending chills down your spine." ],
          [ "Ossuary", " Skulls are stacked against the walls, while ribs and femurs knot together to shape the arches\n overhead — the hollow gazes from the skulls seem to follow your every step." ],
          [ "Sacristy", " A large altar and ornate chests line the walls, though all have been desecrated and looted.\n Faint runes — written in what you can only assume is blood — crawl across the surfaces, their\n meaning unknowable yet deeply unsettling." ],
          [ "Candlelit vault", " Every surface - tables, cupboards, even the floor - is filled with lit candles, their flames\n swaying gently yet never diminishing, distorting your perception of time until hours and days\n bleed into a single, unending moment." ],
          [ "Torture room", " Racks, pillories, and an iron maiden fill the room, their surfaces stained and worn—either\n recently used, or perhaps it’s just this horrid place that preserves such horrors." ],
          [ "Prison cell", " Rusted chains cling to the wall, and following their length, you come upon the crumpled remains\n of a skeleton — an unfortunate soul, long forgotten in this accursed place." ]
        ],
        [
          [ "Tomb corridor", " Long and dark corridor with sarcophagi on both sides each descecrated - or ordained? - with\n demonic scripture" ]
        ]
      ],
      "Sewers": [
        [
          [ "Cistern", " A huge room with angle-high water, cold and damp, with constant dripping from the ceiling\n    that forms stalactites and hints at the place’s ancient age." ],
          [ "Old baths", " A room with small pools that are almost dried out and the sides are covered in slime." ],
          [ "Mossy well", " You see in the middle of the room a well with a pulley and bucket for hoisting water from the\n underground." ],
          [ "Sewage junction", " Here multiple tunnels meet and collect the water in a huge basin, with walkways along the edges\n of the room." ],
          [ "Storage room", " The room has broken shelves and dusty crates scattered about. All are rotten and useless." ],
          [ "Overflow reservoir", " A vast hollow chamber strethces into shadow, its walls marked by dark, wabering stains that show\n where the flood once reached. Massive sluice doors loom at the far end, chained shut, as if to\n hold back something worse than water." ]
        ],
        [
          [ "Sewage passage", " A large passage that collects the waste water from small holes and tunnels and leads it further\n down." ]
        ]
      ],
      "Mine": [
        [
          [ "Ore storer", " Here the ore was counted and stored before it was shipped out of the mine." ],
          [ "Old stope", " An open area that once was covered in ore that now have been mined out." ],
          [ "Crew quarters", " Beds and hammocks are scattered all over the place. It looks as though everyone left in a hurry." ],
          [ "Rusty hoist", " There is a big shaft that goes down into a dark abyss. Next to it is hoist that seems so brittle\n that it would break if you tried to use it." ]
        ],
        [
          [ "Mineshaft", " A long tunnel with wooden boards as floor and timber beams are used to support the roof and walls." ],
          [ "Cartway", " A long tunnel with metal rails across the floor used for moving minecarts with debris or ore." ],
          [ "Winze", " A long tunnel that goes down at an angle, there is a hoist that can be used to move minecarts up\n and down."]
        ]

      ],
      "Natural Cave": [
        [
          [ "Grotto", " The cave expands into a big hollow room formed by an ancient dried up river." ],
          [ "Dripstone cavern", " Multiple small ponds play a soothing melody from the constant dripping of water from stalactites." ],
          [ "Creature lair", " It seems like an unknown creature used to live here. There are corpse leftovers and remains from\n excrements." ],
          [ "Mineral cavern", " Big crystals shine and sparkle in the low light of your torch." ],
          [ "Ore deposits", " Veins of metal flicker on the walls surrounding you signalling undiscovered ores." ]
        ],
        [
          [ "Dark tunnel", " Jagged and narrow walls lead deeper into the cave. The curves makes it hard to see how far it continues."]
        ]
      ]
    }
  },
  {
    "Exits": {
      "Undercroft": [
        [
          "A narrow arch leads to the {0}.",
          "A cold corridor opens towards the {0}.",
          "A stairwell descends toward the {0}.",
          "A big wooden door with rusted hinges leads to the {0}.",
          "There is a small door that leads to the {0}."
        ],
        [
          "A lever reveals a secret passage. It can only be opened from this side."
        ]
      ],
      "Sewers": [
        [
          "A slimy tunnel runs to the {0}.",
          "A big sewage pipe leads to the {0}.",
          "A wet ramp slopes down to the {0}.",
          "A big reninforced door leads to the {0}.",
          "A door with rusted hinges leads to the {0}."
        ],
        [
          "A steep ramp you could slide down into the dark."
        ]
      ],
      "Mine": [
        [
          "A wooden doorway leads to the {0}.",
          "A dark tunnel continues to the {0}.",
          "A rickety ladder drops toward the {0}.",
          "A door with dents and scrathes leads to the {0}.",
          "There is a door with a rusted latch that leads to the {0}."
        ],
        [
          "A broken elevator shaft. You can see water at the bottom, that you reckon would be deep enough\n    to break your fall."
        ]
      ],
      "Natural Cave": [
        [
          "A winding opening goes to the {0}.",
          "A narrow crevice connects to the {0}.",
          "A rocky path leads to the {0}."
        ],
        [
          "There is a hole that connects to some other part of the cave."
        ]
      ]
    }
  }
]